##ΕΠΑΝΑΛΗΠΤΙΚΕΣ ΠΑΝΕΛΛΑΔΙΚΕΣ ΕΞΕΤΑΣΕΙΣ
##HMEΡΗΣΙΩΝ ΚΑΙ ΕΣΠΕΡΙΝΩΝ ΕΠΑΓΓΕΛΜΑΤΙΚΩΝ ΛΥΚΕΙΩΝ
##ΤΡΙΤΗ 30 ΣΕΠΤΕΜΒΡΙΟΥ 2025
##ΕΞΕΤΑΖΟΜΕΝΟ ΜΑΘΗΜΑ:
##ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΥΠΟΛΟΓΙΣΤΩΝ
##
##ΘΕΜΑ Γ
##Μία επιχείρηση απασχολεί ογδόντα (80) υπαλλήλους σε τρία διαφορετικά
##τμήματα. Κάθε υπάλληλος περιγράφεται από μια συμβολοσειρά της μορφής
##“135ΛΠ1300”, όπου οι τρεις πρώτοι χαρακτήρες αντιστοιχούν στον μοναδικό
##αναγνωριστικό αριθμό του υπαλλήλου, ο τέταρτος χαρακτήρας δηλώνει το
##τμήμα στο οποίο εργάζεται ο υπάλληλος (Λογιστήριο (Λ), Γραμματεία (Γ),
##Πωλήσεις (Π)), ο πέμπτος χαρακτήρας δηλώνει το επίπεδο εκπαίδευσης
##(Πανεπιστημιακή (Π), Δευτεροβάθμια Εκπαίδευση (Δ)) και οι τέσσερις
##τελευταίοι χαρακτήρες αντιστοιχούν στον βασικό μισθό του.
##Να αναπτύξετε πρόγραμμα σε γλώσσα προγραμματισμού Python, το οποίο:
##Γ1. Να διαβάζει για κάθε υπάλληλο τη συμβολοσειρά που του αντιστοιχεί.
##Μονάδες 3
##Γ2. Να εμφανίζει για κάθε υπάλληλο τον αναγνωριστικό του αριθμό και τον
##βασικό μισθό του.
##Μονάδες 6
##Γ3. Να υπολογίζει και να εμφανίζει το σύνολο των τελικών μισθών όλων των
##υπαλλήλων του τμήματος της Γραμματείας. Για τον σκοπό αυτό να γίνεται
##κλήση της συνάρτησης TEL_MIST, όπως περιγράφεται στο ερώτημα Γ4.
##Θεωρήστε ότι υπάρχει τουλάχιστον ένας υπάλληλος στη Γραμματεία.
##Μονάδες 6
##Γ4. Να υλοποιεί τη συνάρτηση με όνομα TEL_MIST, η οποία να δέχεται τον
##βασικό μισθό και το επίπεδο εκπαίδευσης ενός υπαλλήλου και να επιστρέφει
##τον τελικό του μισθό, δίνοντας επιπλέον επίδομα 50 ευρώ για το επίπεδο
##Δευτεροβάθμιας Εκπαίδευσης και 200 ευρώ για το επίπεδο Πανεπιστημιακής
##Εκπαίδευσης.
##Μονάδες 5
##Γ5. Να υπολογίζει και να εμφανίζει το ποσοστό των υπαλλήλων με επίπεδο
##Πανεπιστημιακής Εκπαίδευσης στο σύνολο όλων των υπαλλήλων της
##επιχείρησης. Θεωρήστε ότι υπάρχει τουλάχιστον ένας υπάλληλος με επίπεδο
##Πανεπιστημιακής Εκπαίδευσης.
##Μονάδες 5
##Σημείωση: Δεν απαιτούνται έλεγχοι ορθότητας δεδομένων.
##
def TEL_MIST(basikos, epipedo):
    epidoma = 200 if epipedo == 'Π' else 50 if epipedo == 'Δ' else 0
    return basikos + epidoma

YPALLILOI = 80

synolo_mist_gram = 0
ypal_panep = 0

for ypallilos in range(1, YPALLILOI+1):
    kodikos = ""
    while len(kodikos)!=9 or not kodikos[:3].isdigit() \
      or not kodikos[3:5].isalpha() or not kodikos[-4:].isdigit():
        kodikos = input("Κωδικός υπαλλήλου {}: ".format(ypallilos))
    anagnoristiko = kodikos[:3]
    ##basikos = int(kodikos[5:])
    basikos = int(kodikos[-4:]))
    print("Αναγνωριστικό υπαλλήλου {}: {}".format(ypallilos, anagnoristiko))
    print("Βασικός μισθός υπαλλήλου {}: €{}".format(ypallilos, basikos))
    tmima = kodikos[3]
    epipedo = kodikos[4]
    if tmima == 'Γ':
        print("Τελικός μισθός υπαλλήλου {}: €{}".format(ypallilos, TEL_MIST(basikos, epipedo)))
        synolo_mist_gram += TEL_MIST(basikos, epipedo)
    if epipedo == 'Π':
        ypal_panep += 1
print("Σύνολο των τελικών μισθών όλων των υπαλλήλων του τμήματος της Γραμματείας: €{}".format(synolo_mist_gram))
print("Σύνολο υπαλλήλων με επίπεδο Πανεπιστημιακής Εκπαίδευσης: {}".format(ypal_panep))
print("Ποσοστό υπαλλήλων με επίπεδο Πανεπιστημιακής Εκπαίδευσης στο σύνολο όλων των υπαλλήλων της επιχείρησης: {:.1%}".format(ypal_panep / YPALLILOI))
