##ΕΠΑΝΑΛΗΠΤΙΚΕΣ ΠΑΝΕΛΛΑΔΙΚΕΣ ΕΞΕΤΑΣΕΙΣ
##HMEΡΗΣΙΩΝ ΚΑΙ ΕΣΠΕΡΙΝΩΝ ΕΠΑΓΓΕΛΜΑΤΙΚΩΝ ΛΥΚΕΙΩΝ
##ΤΡΙΤΗ 30 ΣΕΠΤΕΜΒΡΙΟΥ 2025
##ΕΞΕΤΑΖΟΜΕΝΟ ΜΑΘΗΜΑ:
##ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΥΠΟΛΟΓΙΣΤΩΝ
##
##ΘΕΜΑ A
##Α2. Να γράψετε στο τετράδιό σας τους αριθμούς 1, 2, 3, 4, 5 από τη στήλη
##Α του παρακάτω πίνακα και δίπλα σε καθέναν από τους αριθμούς, ένα από τα
##γράμματα α, β, γ, δ, ε, στ της στήλης Β, που δίνει τη σωστή
##αντιστοίχιση. Σημειώνεται ότι ένα γράμμα από τη στήλη Β θα περισσέψει.
##ΣΤΗΛΗ Α	    	ΣΤΗΛΗ Β
##1. L.insert(1,item)  	α. Προσθήκη του στοιχείου item στο τέλος λίστας L
##2. L.pop(0)    	β. Επιστρέφει True, αν το στοιχείο item υπάρχει μέσα στη λίστα L, αλλιώς επιστρέφει False
##3. L = [item] + L    	γ. Προσθήκη του στοιχείου item στην θέση 1 της λίστας L
##4. L.append(item)    	δ. Προσθήκη του στοιχείου item στην αρχή της λίστας L
##5. item in L    	ε. Αφαίρεση του πρώτου στοιχείου της λίστας L
##    	    	    	στ. Αφαίρεση του τελευταίου στοιχείου της λίστας L
##Μονάδες 10
##
L = [0, 2]
print("L =", L)
item = 1
L.insert(1,item)
print("L =", L)
L.pop(0)
print("L =", L)
item = 0
L = [item] + L
print("L =", L)
item = 3
L.append(item)
print("L =", L)
item = 2
print("item =", item)
print("item in L:", item in L)
##
##L = [0, 2]
##L = [0, 1, 2]
##L = [1, 2]
##L = [0, 1, 2]
##L = [0, 1, 2, 3]
##item = 2
##item in L: True
##
##1. L.insert(1,item)   γ. Προσθήκη του στοιχείου item στην θέση 1 της λίστας L
##2. L.pop(0)    	ε. Αφαίρεση του πρώτου στοιχείου της λίστας L
##3. L = [item] + L    	δ. Προσθήκη του στοιχείου item στην αρχή της λίστας L
##4. L.append(item)  	α. Προσθήκη του στοιχείου item στο τέλος λίστας L
##5. item in L    	β. Επιστρέφει True, αν το στοιχείο item υπάρχει μέσα στη λίστα L, αλλιώς επιστρέφει False
##    	    	    	στ. Αφαίρεση του τελευταίου στοιχείου της λίστας L
##
##ΘΕΜΑ B
##B1. Δίνονται οι παρακάτω συναρτήσεις που υλοποιούν τη δομή δεδομένων
##στοίβα σε γλώσσα προγραμματισμού Python:
##def push(stack, item):
##    (1)
##def pop(stack):
##    (2)
##def isEmpty(stack):
##    (3)
##def createStack():
##    (4)
##Να γράψετε στο τετράδιό σας τους αριθμούς (1), (2), (3) και (4), που
##αντιστοιχούν στα κενά των παραπάνω συναρτήσεων και δίπλα σε καθέναν από
##τους αριθμούς, αυτό που πρέπει να συμπληρωθεί.
##Μονάδες 8
##
def push(stack, item):
    stack.append(item)  ##    (1)
def pop(stack):
    stack.pop() ##    (2)
def isEmpty(stack):
    return stack == []  ##    (3)
def createStack():
    return []   ##    (4)

stack = createStack()
print("stack =", stack)
print("isEmpty(stack):", isEmpty(stack))
item = 0
push(stack, item)
print("stack =", stack)
item = 1
push(stack, item)
print("stack =", stack)
pop(stack)
print("stack =", stack)
pop(stack)
print("stack =", stack)
print("isEmpty(stack):", isEmpty(stack))
